RANS/coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        physicalType    empty;
        nFaces          10435;
        startFace       16133;
    }
    front
    {
        type            empty;
        physicalType    empty;
        nFaces          10435;
        startFace       26568;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          137;
        startFace       37003;
    }
    circle
    {
        type            wall;
        physicalType    wall;
        nFaces          134;
        startFace       37140;
    }
    walls
    {
        type            wall;
        physicalType    wall;
        nFaces          148;
        startFace       37274;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          28;
        startFace       37422;
    }
)

// ************************************************************************* //
